---
kind: type
id: T:Autodesk.Revit.DB.IFC.ImporterIFCUtils
source: html/63c96f27-12ea-3b90-aa39-515a81c79e33.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFCUtils

A class that contains utilities needed to implement Revit's version of the IFC import client application.

## Syntax (C#)
```csharp
public static class ImporterIFCUtils
```

## Remarks
This class contains special API utilities needed to enable the implementation of the client application
 for IFC import. Some of these utilities will be needed temporarily while the code for IFC import is
 migrated into the export client. These temporary interfaces are likely to change in upcoming Revit
 releases.